Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkData.IsValidContainerName(System.String)
Validates that the given name is valid for use as the container name of an extended properties link.
Remarks:
A valid name must not contain non-printable characters, characters invalid for a path, and must
contain at least one non-whitespace character.
Returns:
True if the name can be used as the container name of an extended properties link. False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkData.AddValues(Autodesk.Revit.DB.LinkElementId,Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkValues)
Adds the provided parameter values to the Revit Element identified by %elementId%.
elementId:
The identifier of the Element to add the parameter values.
values:
The values to be added.
Returns:
True if all of the values were added, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkData.AddParameterSchemaWithBindings(Autodesk.Revit.DB.ForgeTypeId,Autodesk.Revit.DB.ExternalData.ExtendedPropertiesBindings)
Adds a schema id to the extended properties link.
schemaId:
Identifier of the schema to add.
bindings:
The bindings for the schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ForgeTypeId represents a malformed schema identifier.
-or-
Thrown when the schemaId already contains bindings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkData.HasSchema(Autodesk.Revit.DB.ForgeTypeId)
Queries whether the schema already exists in this data.
schemaId:
Identifier of the schema to check.
Returns:
True if the schema already exists in this data, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkData.Region
The region of the account that contains the parameter definitions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The region is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkData.ContainerName
The extended properties container name used as a custom group in the properties palette.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given name is not valid for use as the container name of an extended properties link.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkData.#ctor
Constructs an empty object which can be used to add parameter schemas, bindings, and values.
Remarks:
The container name must be specified before the link data can be used by a
Autodesk::Revit::DB::ExternalData::ExtendedPropertiesLinkLoadContent.
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkData
Represents the data needed to establish or update an ExtendedPropertiesLink.
To be used as part of the result of invoking an external server in order to
update or create an ExtendedPropertiesLink.
Since:
2027